Revit 2027 API
LabelUtils.GetLabelFor(BuiltInParameter) Method
 Gets the user-visible name for a BuiltInParameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GetLabelFor(
	BuiltInParameter builtInParam
)
Public Shared Function GetLabelFor (
	builtInParam As BuiltInParameter
) As String
public:
static String^ GetLabelFor(
	BuiltInParameter builtInParam
)
static member GetLabelFor :
        builtInParam : BuiltInParameter -> string
Parameters
builtInParam BuiltInParameter
 The BuiltInParameter to get the user-visible name.
Return Value
String
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the BuiltInParameter cannot be found.
Remarks
 The name is obtained in the current Revit language.
See Also
Reference
LabelUtils Class
GetLabelFor Overload
Autodesk.Revit.DB Namespace